{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid for a minimum of 1 month beyond the period of intended\n  stay. \n - Passports and other documents accepted for entry issued by\n   Hong Kong (SAR China) must be valid on arrival. \nPassport Exemptions:\n- Holders of Hong Kong (SAR China) Permanent Identity Card. \n- Holders of emergency or temporary passports.\n\nVisa required, except for A max stay of 90 days for holders of\na Hong Kong (SAR China) \"Single Entry Permit\" issued to\nresidents of Chinese Taipei. (SEE NOTE 49397)\n    NOTE 49397: Provided accompanied by a travel document for\n   re-entry to Chinese Taipei, valid for at least 2 months\n   beyond the period of intended stay. \nVisa required, except for A max stay of 30 days:\n - for holders of Mainland Travel Permit for Taiwan Residents\n   (Tai Bao Zheng). (SEE NOTE 49397) \n     NOTE 49397: Provided accompanied by a travel document for\n    re-entry to Chinese Taipei, valid for at least 2 months\n    beyond the period of intended stay. \n - for holders of Hong Kong (SAR China)  Multiple Entry\n   Permit\" issued to residents of Chinese Taipei. (SEE NOTE\n   49397) \n     NOTE 49397: Provided accompanied by a travel document for\n    re-entry to Chinese Taipei, valid for at least 2 months\n    beyond the period of intended stay. \n - for holders of a  Notification Slip for Pre-arrival\n   Registration for Taiwan Residents  (PAR). (SEE NOTE 49396)\n     NOTE 49396: Provided accompanied by a travel document for\n    re-entry to Chinese Taipei, valid for at least 6 months\n    upon arrival in Hong Kong.\nVisa required, except for Holders of:\n- travel documents issued by the Hong Kong Immigration\nDepartment, endorsed with \"Holder's eligibility for Hong Kong\n(SAR China) Permanent Identity Card verified ; or\n- a Hong Kong (SAR China) Permanent Identity Card. \nVisa required, except for Holders of an APEC Business Travel\nCard (ABTC) provided endorsed  Valid for travel\nto HKG\":\n - traveling on business;\n - holders of a Chinese Taipei ABTC must also present an\n   \"Entry Permit\" or \"Entry Permit (iPermit)\" issued by Hong\n   Kong (SAR China) to residents of Chinese Taipei.\nAdditional Information:\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents required for their next\n  destination.\nWarning:\n- Passport number and nationality must match those stated on\n  the APEC Business Travel Card (ABTC).\n- Visitors not holding return/onward ticket could be refused\n  entry","vaccination":"Vaccinations not required.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"HKG","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}