{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid on arrival. \n - Emergency or temporary passports must be valid for a\n   minimum of 6 months from the arrival date. \nPassport Exemptions:\n- Holders of emergency or temporary passports. \n\nVisa required, except for A max. stay of 90 days, if traveling\nas tourists: \n - for holders of normal passports issued to nationals of\n   Venezuela; \nMinors:\n- Unaccompanied passengers under 18 years of age are required\n  to \nAdditional Information:\n- Dual nationality is recognised by Bolivia, however\n  \n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents required for their next\n  destination.\n- For holders of normal passports the max. stay is granted\n  within one year. Extension of stay possible.  \nWarning:\n- Visitors not holding return/onward tickets could be refused\n  entry","vaccination":"Vaccination against yellow fever is required if arriving\nwithin 6 days after leaving or transiting countries with risk\nof yellow fever transmission For details, click here. \n\nExempt from Yellow Fever vaccination:\n- Children under 1 year of age.\n- Passengers transiting countries with risk of yellow fever\n  transmission within 12 hours if not leaving the transit\n  areas. \nRecommended:\n- Vaccination against yellow fever recommended for all\n  passengers of 9 months of age and older traveling to the\n  following areas east of the Andes at altitudes below 2300 m:\n  the entire Depts. of Beni, Pando and Santa Cruz, and\n  designated areas of the departments of Chuquisaca,\n  Cochabamba, La Paz and Tarija. \n- Malaria prophylaxis. Malaria risk, mainly due to P. vivax,\n  exists throughout the year in the whole country below 2500m\n  with P. falciparum present in Santa Cruz and Beni and Pando\n  departments. Recommended prevention in risk areas: B; in\n  Beni, Pando and Santa Cruz: C. ","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"BOL","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}