{"longInfo":"Passport required.\n- Passports and/or passport replacing documents must be valid\n  for at least 6 months from date of arrival.\n - When applying for a visa on arrival, passports issued to\n   nationals of Mauritius must be valid for at least 30 days\n   from arrival date\nPassport Exemptions:\n- Holders of emergency or temporary passports.\n\nVisa Issuance:\nVisa required, except for Those traveling as a tourist can\nobtain a visa on arrival for a max. stay of 15 days, if:\n \n    NOTE 45339: Furthermore, passengers must hold confirmed\n   tickets for onward/return journey within 15 days from\n   arrival date, at least THB 10,000.- per person (or THB\n   20,000.- per family) and must clear Customs and Immigration\n   Quarantine (CIQ) immediately at the point where the visa is\n   obtained. Fee: THB 1,000.-.\n - Applicable only at Bangkok (BKK and DMK), Chiang Mai (CNX),\n   Chiang Rai (CEI), Hat Yai (HDY), Krabi (KBV), Phuket (HKT),\n   Samui Int'l (USM), Sukhothai Int'l (THS), Surat Thani (URT)\n   and Utapao (UTP) airports.\n - Passport photo facilities are only available at Bangkok\n   Int'l Airport (BKK).\nAdditional Information:\n- Visitors who are visa exempt are required to hold documents\n  for their next destination.\n- Visitors over 12 years of age are required to hold\n  sufficient funds to cover their stay (at least THB 10,000.-\n  per person or THB 20,000.- per family).\n   \nWarning:\n- Visitors who are visa exempt but do not hold return/onward\n  tickets could be refused entry","vaccination":"Vaccination against yellow fever required if arriving within\n10 days after leaving or transiting countries with risk of\nyellow fever transmission For details, click here.\n\nExempt from Yellow Fever vaccination:\n- Children under 1 year of age. \n- Passengers transiting countries with risk of yellow fever\n  transmission if not leaving the transit areas. \nRecommended:\n- Malaria prophylaxis: malaria risk exists throughout the year\n  in rural, especially forested and hilly areas of the country\n  mainly towards the international borders, including the\n  southernmost provinces. There is no risk in cities, urban\n  areas, Samui Isl. and the main tourist resorts of Phuket\n  Isl.. Human P. knowlesi infection reported. Recommended\n  prevention in risk areas: A; in areas near Cambodia and\n  Myanmar borders: D. ","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"THA","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}