{"longInfo":"Passport required.\n- Passports issued to nationals of Croatia must be valid for\n  the period of intended stay. \nPassport Exemptions:\n- Holders of a Form I-512 ( Authorization for Parole of an\n  Alien into the United States\"). \n- Holders of temporary or emergency passports. \n\nVisa required, except for Holders of a Form I-512\n( Authorization for Parole of an Alien into the United\nStates\").\nMinors:\n- Children, up to/incl. 15 years of age, excluding nationals\n  of the USA and nationals entitled to travel under the US\n  Visa Waiver Program (V.W.P.), are allowed to travel on their\n  parent's passport. A person included in the passport of\n  another may not use the passport for travel unless he/she is\n  accompanied by the passport holder. \n- Minors traveling unaccompanied, or accompanied by one parent\n  or a person other than parent/legal guardian,\n  . \n- WARNING! In accordance with European Union (EU) Legislation,\n  all minors who are nationals of Croatia will be expected to\n  hold their own passport or National ID Card (where\n  applicable) when departing from Bulgaria, Croatia, Cyprus,\n  Romania or a Schengen Member State . \nAdditional Information:\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents required for their next\n  destination. \n- A passenger may enter the USA with a valid visa in an\n  expired passport, provided \n- Beginning students holding \"F\", \"J\" or \"M\" student/exchange\n  visitor visas \nWarning:\n- Passengers who have visited Guinea, Liberia or Sierra Leone\n  within the last 21 days must enter the US at Atlanta (ATL),\n  Chicago (ORD), Newark (EWR), New York (JFK) or Washington\n  (IAD)  and are subject to screening and medical checks upon\n  arrival. \n\n\n\n Virgin Isl","vaccination":"Vaccinations not required.\n\nWarning:\n- Those entering on a K-1 or K-2 visa must hold a medical form\n  FS398 and X-ray plates of chest (full size not necessary).","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"VIR","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}