{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid for a minimum of 3 months from the arrival date. \n - Passports issued to visitors born in Panama must be valid\n   on arrival.\nPassport Exemptions:\n- Holders of emergency or temporary passports.\n\nVisa required, except for A max. stay of 180 days for\nnationals of Netherlands. \nMinors:\n- WARNING! In accordance with European Union (EU) Legislation,\n  all minors who are nationals of Netherlands will be expected\n  to hold their own passport or National ID Card (where\n  applicable) when departing from Bulgaria, Croatia, Cyprus,\n  Romania or a Schengen Member State . \nAdditional Information:\n- Visitors are required to hold proof of sufficient funds of\n  at least USD 500.- per person to cover their stay (e.g. in\n  the form of cash (USD only), traveller's cheques, major\n  credit cards).\n- Visitors are required to hold documents for their next\n  destination. \nWarning:\n- Visitors must hold return/onward tickets. (SEE NOTE 53772) \n    NOTE 53772: Exempt are those born in Panama, provided\n   holding a National ID Card or a Birth Certificate issued by\n   Panama","vaccination":"YELLOW FEVER VACCINATION NOT REQUIRED.\n\nRecommended:\n- Vaccination against yellow fever for passengers of 9 months\n  of age and older travelling to all mainland areas east of\n  the Canal Zone, (the entire comarcas of Embera and Kuna\n  Yala, the province of Darien and areas of the provinces of\n  Colon and Panama that are east of the Canal Zone.\n  Malaria prophylaxis: malaria risk, mainly due to P. vivax\n  exists throughout the year in provinces and Comarcas along\n  the Atlantic coast and the borders with Costa Rica and\n  Colombia: Bocas del Toro, Chiriqui, Colon, Darien, Kuna\n  Yala, Ngabe Bugle, Panama and Veraquas. In Panama City, the\n  Canal Zone, and in the other provinces there is no or\n  negligible risk of transmission. Recommended prevention in\n  risk areas: B; areas bordering Colombia: C.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"PAN","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}