{"longInfo":"Passport required. \n- Passports and other documents accepted for entry must be\n  valid for a minimum of 6 months from the arrival date. \nPassport Exemptions:\n- Holders of temporary passports.\n\nVisa Issuance:\nVisa required, except for Visitors traveling as tourist can\nobtain a visa on arrival for a max. stay of 90 days. Fee:\nbetween USD 25.- and USD 100.- or equivalent in convertible\ncurrency.  (SEE NOTE 56906)\n    NOTE 56906: Not applicable to holders of temporary\n   passports, who must obtain a visa prior to travel.\n- Visitors traveling on business can obtain a visa on arrival\n  for a max. stay of 5 years, provided holding a license\n  issued by the Ministry of Industry. Fee: between USD 100.-\n  and USD 300.- or equivalent in convertible currency.  (SEE\n  NOTE 56906)\n    NOTE 56906: Not applicable to holders of temporary\n   passports, who must obtain a visa prior to travel.\nMinors:\n- WARNING! In accordance with European Union (EU) Legislation,\n  all minors who are nationals of Netherlands will be expected\n  to hold their own passport or National ID Card (where\n  applicable) when departing from Bulgaria, Croatia, Cyprus,\n  Romania or a Schengen Member State ","vaccination":"Vaccination against yellow fever required if arriving within 6\ndays after leaving or transiting countries with risk of yellow\nfever transmission For details, click here.\n\nExempt from Yellow Fever vaccination:\n- Those not leaving the airport in the countries with risk of\n  yellow fever transmission. \nRecommended:\n- Malaria prophylaxis: malaria risk, mainly due to P. vivax,\n  exists throughout the year in rural areas of the Terai\n  districts bordering with India, with occasional outbreaks of\n  P. falciparum from July to October inclusive. Seasonal\n  transmission of P. vivax takes place in districts of the\n  inner Terai and midhills. Recommended prevention in risk\n  areas: C. ","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"NPL","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}