{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid for a minimum of 3 months from the arrival date. \nPassport Exemptions:\n- Holders of emergency or temporary passports.\n\nVisa required, except for A max. stay of 90 days for holders\nof a valid multiple entry visa issued by the USA, if having\nused the visa to enter the USA at least once. \nVisa required, except for A max. stay of 90 days for holders\nof a valid multiple entry visa issued by the United Kingdom,\nif having used the visa to enter the United Kingdom at least\nonce. \nVisa required, except for A max. stay of 90 days for holders\nof a valid multiple entry  C  visa issued by a Schengen Member\nState  if having used the visa to enter the\nSchengen Area at least once.\nVisa required, except for A max. stay of 90 days for holders\nof a valid \"D\" visa issued by a Schengen Member State\n if having used the visa to enter the Schengen\nArea at least once.\n- Information on Schengen visas  \nVisa Issuance:\n- Holders of a letter issued by the Albanian Ministry of\n  Interior confirming that a visa will be available on arrival\n  can obtain a visa on arrival. \nAdditional Information:\n- The max. stay allowed under visa exemptions (when\n  applicable), is granted within 6 months. \n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents required for their next\n  destination.\n- Visitors of Albanian ethnicity do not require visa to enter\n  Albania for a max. stay of 90 days within 180 days.  \nWarning:\n- Nationals of Uzbekistan are required to hold a biometric\n  passport when departing Uzbekistan.\n- Visitors not holding return/onward tickets could be refused\n  entry","vaccination":"Vaccination against yellow fever required if arriving within 6\ndays after leaving or transiting countries with risk of yellow\nfever transmission For details, click here.\n\nExempt from Yellow Fever vaccination:\n- Children under 1 year of age.\n- Passengers transiting countries with risk of yellow fever\n  transmission if not leaving the transit areas.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"ALB","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}