{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid on arrival. \n\nVisa required, except for Holders of a Pakistan Origin Card\n(POC) or a National Identity Card for Overseas Pakistanis\n(NICOP), for an unlimited period of stay. \nVisa Issuance:\nVisa required, except for Nationals of Japan traveling on\nbusiness, can obtain a pre-arranged visa on arrival for a max.\nstay of 30 days, provided: \n- Passengers of Pakistani origin can obtain a temporary\n  landing permit for 72 hours, provided:\n  \nAdditional Information:\n- Extention of stay if possible; to be applied for at the\n  Ministry of Interior.\n- Visitors who overstay \nWarning:\n- Visitors not holding return/onward ticket could be refused\n  entry.\n - Exempt are holders of a Pakistan Origin Card (POC), holders\n   of a National Identity Card for Overseas Pakistanis\n   (NICOP), holders of passports containing a \"Visa exempt\"\n   stamp issued by Pakistan and passengers having dual\n   nationality and using Pakistan passport","vaccination":"Passengers arriving within 6 days after leaving or transiting\ncountries with risk of yellow fever transmission For details, click here\nand not holding a yellow fever vaccination certificate are\nsubject to quarantine for 6 days.\n\nExempt from Yellow Fever vaccination:\n- Children under 9 months of age if the mother's vaccination\n  certificate shows that she has been duly vaccinated prior to\n  the birth of the child. \n- Passengers transiting countries with risk of yellow fever\n  transmission provided not leaving the transit areas.\nWarning:\n- Vaccination against Polio prior to departure from Pakistan\n  required for all nationals and residents of Pakistan, and\n  for visitors staying in Pakistan for more than 4 weeks.\nRecommended:\n- Malaria prophylaxis: malaria risk (P. vivax and P.\n  falciparum) exists throughout the year in the whole country\n  below 2000m, especially in rural areas from July to\n  December. Recommended prevention: C. ","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"PAK","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}