{"longInfo":"Passport required. \n- Passports and other documents accepted for entry must be\n  valid for a minimum of 3 months from the arrival date.\n\nVisa required, except for A max. stay of 3 months: \nMinors:\n- Persons under 21 years are considered to be minors.\n   \n- WARNING! In accordance with European Union (EU) Legislation,\n  all minors who are nationals of New Caledonia will be\n  expected to hold their own passport or National ID Card\n  (where applicable) when departing from Bulgaria, Croatia,\n  Cyprus, Romania or a Schengen Member State . \nAdditional Information:\n- Visitors are required to hold documents required for their\n  next destination.\n- Visa extensions can be obtained at the Immigration\n  Department for a fee varying between USD 10.- and USD 50.-.\nWarning:\n- Visitors not holding return/onward ticket could be refused\n  entry","vaccination":"Vaccination against yellow fever required if arriving from\nAngola, Argentina, Benin, Bolivia, Brazil, Burkina Faso,\nBurundi, Cameroon, Central African Rep., Chad, Colombia,\nCongo, Congo (Dem. Rep.), Cote d'Ivoire, Ecuador, Equatorial\nGuinea, Ethiopia, French Guiana, Gabon, Gambia, Ghana,\nGuinea-Bissau, Guinea, Guyana, Kenya, Liberia, Mali,\nMauritania, Niger, Nigeria, Paraguay, Peru, Rwanda, Sao Tome\nand Principe, Senegal, Sierra Leone, Somalia, Sudan, Suriname,\nTanzania, Togo, Trinidad and Tobago, Uganda and Venezuela. \n\nExempt from Yellow Fever vaccination:\n- Children under 1 year of age.\n- Passengers of 65 years of age or older.\n- Passengers transiting countries with risk of yellow fever\n  transmission provided not leaving the transit areas.\nRecommended:\n- Malaria prophylaxis: malaria risk, mainly due to P. vivax,\n  is high in the departments of Gracias a Dios and Islas de la\n  Bahia, and moderate in Atlantida, Olancho and Yoro. P.\n  falciparum transmission risk is high in Gracias a Dios.\n  Recommended prevention in risk areas: B. ","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"HND","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}