{"longInfo":"Passport required.\n- British passports endorsed  British Citizen  must be valid\n  on arrival.\n- British passports endorsed  British Subject  containing a\n  Certificate of Entitlement to the Right of Abode issued by\n  the United Kingdom must be valid on arrival. \n- British passports endorsed  British Overseas Territories\n  Citizen  issued by Gibraltar must be valid on arrival. \n- British passports endorsed  British Citizen  that have been\n  extended 12 months by an extension stamp contained within\n  the passport are accepted.\n- Other British passports must be valid for at least 3 months\n  beyond the period of intended stay.\nPassport Exemptions:\n- Holders of emergency or temporary passports.\n\nVisa required, except for Holders of British passports\nendorsed  British Citizen .\nVisa required, except for Holders of British passports\nendorsed  British Overseas Territories Citizen , issued by\nGibraltar. \nVisa required, except for Holders of British passports\nendorsed  British Subject , containing a Certificate of\nEntitlement to the Right of Abode issued by the United\nKingdom. \nVisa required, except for A max. stay of 90 days:\n - for holders of British passports endorsed  British Overseas\n   Territories Citizen , issued by  \n - for holders of British passports endorsed  British\n   Subject , not containing a Certificate of Entitlement to\n   the Right of Abode issued by the United Kingdom; \n - for holders of British passports endorsed  British National\n   (Overseas) ,  British Overseas Citizen  or  British\n   Protected Person\"; \nMinors:\n-  Passport required unless \n- A visa issued to the parent is also valid for the minor\n  provided minor's name is also mentioned in the visa.\nAdditional Information:\n- Valid visas in full, invalidated or expired travel documents\n  are accepted if accompanied by a new travel document. \n- Extension of stay possible for \nWarning:\n- These entry regulations apply only to the part of Cyprus\n  controlled by the government of Cyprus (i.e. they are not\n  applicable at Ercan (ECN) and at Gercitkale (GEC)).\n - For entry regulations applicable at Ercan (ECN), see:\n   http://mfa.gov.ct","vaccination":"Vaccinations not required.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"CYP","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}