{"longInfo":"Passport required.\n- British passports endorsed  British Citizen  must be valid\n  on arrival. \n- British passports endorsed  British Subject  containing a\n  Certificate of Entitlement to the Right of Abode issued by\n  the United Kingdom must be valid on arrival.\n- British passports endorsed  British Overseas Territories\n  Citizen  issued by Gibraltar must be valid on arrival. \n- British passports endorsed  British Citizen  that have been\n  extended 12 months by an extension stamp contained within\n  the passport are accepted.\n- Other British passports must be valid for at least 3 months\n  beyond the period of intended stay.\n\nVisa required, except for Holders of British passports\nendorsed  British Citizen . \nVisa required, except for Holders of British passports\nendorsed  British Overseas Territories Citizen , issued by\nGibraltar. \nVisa required, except for Holders of British passports\nendorsed  British Subject , containing a Certificate of\nEntitlement to the Right of Abode issued by the United\nKingdom. \nVisa required, except for A max. stay of 90 days for holders\nof British passports endorsed  British Overseas Territories\nCitizen , issued by  (SEE NOTE 56309)\n\n    NOTE 56309: The max. stay is granted within 180 days.\nVisa required, except for A max. stay of 90 days for holders\nof British passports endorsed  British Subject , not\ncontaining a Certificate of Entitlement to the Right of Abode\nissued by the United Kingdom. (SEE NOTE 56309) \n    NOTE 56309: The max. stay is granted within 180 days.\nVisa required, except for A max. stay of 90 days for holders\nof British passports endorsed  British National (Overseas) ,\n British Overseas Citizen  or  British Protected Person . (SEE\nNOTE 56309) \n    NOTE 56309: The max. stay is granted within 180 days.\nAdditional Information:\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents required for their next\n  destination.\n- Valid visas in full, invalidated travel documents are\n  accepted provided the page containing the visa has not been\n  invalidated and is accompanied by a new travel document","vaccination":"Vaccinations not required.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"ISL","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}