{"longInfo":"Passport required.\n- British passports endorsed  British Citizen  must be valid\n  on arrival. \n- British passports endorsed  British Subject  containing a\n  Certificate of Entitlement to the Right of Abode issued by\n  the United Kingdom must be valid on arrival. \n- British passports endorsed  British Overseas Territories\n  Citizen  issued by Gibraltar must be valid on arrival. \n- Identity Cards issued by Gibraltar must be valid on arrival.\n- British passports endorsed  British Citizen  that have been\n  extended 12 months by an extension stamp contained within\n  the passport are accepted.\n- Other British passports must be valid for at least 3 months\n  beyond the period of intended stay.\nPassport Exemptions:\n- Holders of a National ID Card: \n - issued by Gibraltar.\n\nVisa required, except for Holders of British passports\nendorsed  British Citizen . \nVisa required, except for Holders of British passports\nendorsed  British Overseas Territories Citizen , issued by\nGibraltar.\nVisa required, except for Holders of Identity Cards issued by\nGibraltar. \nVisa required, except for Holders of British passports\nendorsed  British Subject , containing a Certificate of\nEntitlement to the Right of Abode issued by the United\nKingdom. \nVisa required, except for A max. stay of 90 days for holders\nof British passports endorsed  British Overseas Territories\nCitizen , issued by  (SEE NOTE 56269)\n\n    NOTE 56269: The max. stay is granted within 180 days.\nVisa required, except for A max. stay of 90 days for holders\nof endorsed  British Subject , not containing a Certificate of\nEntitlement to the Right of Abode issued by the United\nKingdom. (SEE NOTE 56269) \n    NOTE 56269: The max. stay is granted within 180 days.\nVisa required, except for A max. stay of 90 days for holders\nof British passports endorsed  British National (Overseas) ,\n British Overseas Citizen  or  British Protected Person . (SEE\nNOTE 56269) \n    NOTE 56269: The max. stay is granted within 180 days.\nAdditional Information:\n- Valid visas in full, invalidated travel documents are\n  accepted provided accompanied by a new travel document","vaccination":"Vaccinations not required. \n\nRecommended:\n- Malaria prophylaxis. malaria risk, exclusively due to P.\n  vivax, is very limited and may exist from May to October in\n  villages of the Evrotas delta area in Lakonia district in\n  agricultural areas with large migrant populations. There is\n  no risk in tourist areas. Recommended prevention in risk\n  area: A. ","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"GRC","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}