{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid for a minimum of 6 months from the arrival date.\n- British passports endorsed  British Citizen  that have been\n  extended 12 months by an extension stamp contained within\n  the passport are accepted.\nPassport Exemptions:\n- Holders of emergency or temporary passports.\n\nVisa required, except for A max. stay of 90 days for holders\nof British passports endorsed  British Citizen  (not\napplicable to holders of Emergency and Temporary Passport, who\nmust obtain a visa on arrival).\nVisa required, except for A max. stay of 30 days for holders\nof an ROC (Taiwan) Business and Academic Travel Card, issued\nby Chinese Taipei. \nVisa Issuance:\nVisa required, except for Holders of British passports\nendorsed  British Citizen  (applicable when holding an\nEmergency or Temporary Passport) can obtain a visa on arrival,\nfor a max. stay of 30 days, provided:\n (SEE NOTE 43278)  \n    NOTE 43278: Available only at Taiwan Taoyuan International\n   Airport (TPE), Kaohsiung (KHH), Taichung (RMQ) or Taipei\n   Song Shan (TSA).\nVisa required, except for Permanent residents of Hong Kong\n(SAR China) BORN in Hong Kong (SAR China) or Macao (SAR China)\ncan obtain \"Entry Permit\" on arrival, for a max. stay of 30\ndays, provided  \nVisa required, except for Permanent residents of Hong Kong\n(SAR China) NOT BORN in Hong Kong (SAR China) or Macao (SAR\nChina), who have made previous visits to Chinese Taipei, can\nobtain an \"Entry permit\" on arrival for a max. stay of 30\ndays, provided  \nMinors:\n- For children (up to/incl. 19 years) traveling\n  \nAdditional Information:\n- A valid visa in an expired passport\n  \n- Visitors are required to hold documents for their next\n  destination.\n- Extension of stay for another 90 days is possible for\n  holders of British passports endorsed  British Citizen .\n- Former nationals of China (People's Rep.)\n   \n- Permanent residents of Hong Kong (SAR China) and Macao (SAR\n  China) NOT BORN in Hong Kong (SAR China) or Macao (SAR\n  China), who have obtained an Online Entry Permit\n  \nWarning:\n- Visitors not holding return/onward tickets could be refused\n  entry","vaccination":"Vaccinations not required.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"TWN","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}