{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid for the period of intended stay. \n - British Passports endorsed British Citizen or British\n   Overseas Territories Citizen must be valid on arrival.   \n- British passports endorsed  British Citizen  that have been\n  extended 12 months by an extension stamp contained within\n  the passport are accepted.\nPassport Exemptions:\n- Holders of proof of citizenship issued to residents of the\n  Cayman Isl.\n- Holders of emergency or temporary passports.\n\nVisa required, except for Holders of British Passports\nendorsed  British Overseas Territories Citizen  issued by the\nCayman Isl.. \nVisa required, except for Holders of proof of citizenship\nissued to residents of Cayman Isl..\nVisa required, except for Holders of British passports\nendorsed  British Citizen  also holding a Caymanian Status\nCertificate or expired  British Overseas Territories Citizen \npassport issued by the Cayman Isl.\nVisa required, except for Holders of British passports\nendorsed  British Citizen  (SEE NOTE 55485) (SEE NOTE 55486).\n    NOTE 55485: for a max. stay of 60 days when traveling as\n   tourist.\n    NOTE 55486: for a max. stay of 10 days when traveling for\n   business purposes.\nVisa required, except for Holders of British passports\nendorsed  British Overseas Territories Citizen  (SEE NOTE\n55485) (SEE NOTE 55486), issued by  .\n    NOTE 55485: for a max. stay of 60 days when traveling as\n   tourist.\n    NOTE 55486: for a max. stay of 10 days when traveling for\n   business purposes.\nVisa required, except for A max. stay of 30 days for holders\nof British passports endorsed  British National (Overseas) ,\n British Overseas Citizen ,  British Subject  or  British\nProtected Person\" who have been granted \"Indefinite Leave to\nRemain\" in the United Kingdom and arriving directly from the\nUnited Kingdom. \nAdditional Information:\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents required for their next\n  destination.\n- The period of stay granted for all visitors will be\n  determined by the Immigration Officer on arrival.\n- Extension of tourist stay possible up to a total stay of 180\n  days.\nWarning:\n- Nationals of United Kingdom who have visited Guinea, Liberia\n  or Sierra Leone within the last 21 days will be refused\n  entry. \n- Visitors not holding return/onward tickets  co\n  uld be refused entry.\n\n\n\n Cayman Isl","vaccination":"Vaccinations not required.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"CYM","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}