{"longInfo":"Passport required. \n- Passports and other documents accepted for entry must be\n  valid for the period of intended stay.  \n- British passports endorsed  British Citizen  that have been\n  extended 12 months by an extension stamp contained within\n  the passport are accepted.\nPassport Exemptions:\n- Holders of emergency or temporary passports.\n- Holders of a \"Laissez-Passer\" issued by Brazil.\n\nVisa required, except for A max. stay of 90 days:\n - for holders of normal, emergency or temporary British\n   passports; \nAdditional Information:\n- The validity of long term (1, 3 and 5 years) tourist and\n  business visas starts on the day of issuance. \n- Extension of stay possible for visa exempt visitors. \n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents required for their next\n  destination.\n- Holders of multiple entry  Temp V  visa issued by Brazil\n  must:.\nWarning:\n- Visitors who have recently visited Guinea, Liberia and\n  Sierra Leone are subject to screening and health checks on\n  arrival.\n- Visitors not holding return/onward ticket could be refused\n  entry.\n - Exempt are holders of a \"VIPER\" visa issued by Brazil","vaccination":"Vaccinations not required.\n\nRecommended:\n- Vaccination against yellow fever for all passengers of 9\n  months of age and older visiting areas where transmission\n  risk exists, including rural areas in: Acre, Amap,\n  Amazonas, Distrito Federal (incl. the capital city of\n  Brasilia), Gois, Maranho, Mato Grosso, Mato Grosso do Sul,\n  Minas Gerais, Par, Rondnia, Roraima, Tocantins, and to\n  other state areas where transmission risk exists including\n  all the states of Minas Gerais and specific areas of Bahia,\n  Paran, Piaui, Rio Grande do Sul, Santa Catarina and So\n  Paulo states. Vaccination is also recommended for travellers\n  visiting Iguazu Falls. The complete list of municipalities\n  are available at www.saude.gov.br/svs05\n- Malaria prophylaxis: malaria risk is negligible in the\n  states outside the administrative region of the Amazones.\n  Malaria risk, mainly due to P. vivax but also P. falciparum\n  exists in most forested areas below 900m of the Amazon\n  region. Recommended prevention in risk areas: C.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"BRA","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}