{"longInfo":"Passport required.\n- British passports endorsed  British Citizen  must be valid\n  for the period of intended stay. \n- British passports endorsed  British Subject  which\n  containing a Certificate of Entitlement to the Right of\n  Abode issued by the United Kingdom must be for the period of\n  intended stay. \n- British passports endorsed  British Overseas Territories\n  Citizen  issued by Gibraltar must be for the period of\n  intended stay. \n- British passports endorsed  British Citizen  that have been\n  extended 12 months by an extension stamp contained within\n  the passport are accepted.\n- Other British passports must be valid for at least 3 months\n  beyond the period of intended stay.\nPassport Exemptions:\n- Holders of emergency or temporary passports.\n\nVisa required, except for Holders of British passports\nendorsed  British Citizen .\nVisa required, except for Holders of British passports\nendorsed  British Overseas Territories Citizen , issued by\nGibraltar.\nVisa required, except for Holders of British passports\nendorsed  British Subject  containing a Certificate of\nEntitlement to the Right of Abode issued by the United\nKingdom. \nVisa required, except for  A max. stay of 90 days (SEE NOTE\n56110): \n - for holders of British passports endorsed  British Overseas\n   Territories Citizen , issued by \n - for holders of British passports endorsed  British\n   Subject , not containing a Certificate of Entitlement to\n   the Right of Abode issued by the United Kingdom;\n    NOTE 56110: The max. stay is granted within 180 days.\n - for holders of British passports endorsed  British National\n   (Overseas) ,  British Overseas Citizen  or  British\n   Protected Person\".\nAdditional Information:\n- National visas issued by Bulgaria are only accepted when\n  contained in a valid travel document.\n- Where Schengen visas exempt the holders from a Bulgarian\n  national visa, valid visas issued by a Schengen Member State\n   in full, invalidated travel documents are\n  accepted if accompanied by a new travel document","vaccination":"Vaccinations not required.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"BGR","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}