{"longInfo":"Passport required.\n- British passports endorsed  British Citizen  must be valid\n  for the period of intended stay.\n- British passports endorsed  British Subject  which also\n  contain a Certificate of Entitlement to the Right of Abode\n  issued by the United Kingdom must be valid for the period of\n  intended stay. \n- British passports endorsed  British Overseas Territories\n  Citizen  issued by Gibraltar must be valid on arrival.\n- Identity Cards issued by Gibraltar must be valid on arrival.\n- British passports endorsed  British Citizen  that have been\n  extended 12 months by an extension stamp contained within\n  the passport are accepted.\n- Other British passports must be valid for at least 3 months\n  beyond the period of intended stay.\nPassport Exemptions:\n- Holders of Identity Cards issued by Gibraltar.\n\nVisa required, except for Holders of British passports\nendorsed  British Citizen .\nVisa required, except for Holders of British passports\nendorsed  British Overseas Territories Citizen , issued by\nGibraltar. \nVisa required, except for Holders of Identity Cards issued by\nGibraltar.\nVisa required, except for Holders of British passports\nendorsed  British Subject , containing a Certificate of\nEntitlement to the Right of Abode issued by the United\nKingdom. \nVisa required, except for A max. stay of 90 days: (SEE NOTE\n53527) \n    NOTE 53527: The max. stay is granted within 180 days. \n - for holders of British passports endorsed  British Overseas\n   Territories Citizen , issued by \n - for holders of British passports endorsed  British\n   Subject , not containing a Certificate of Entitlement to\n   the Right of Abode issued by the United Kingdom; \n - for holders of British passports endorsed  British National\n   (Overseas) ,  British Overseas Citizen  or  British\n   Protected Person\"; \nAdditional Information:\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay as follows:\n  - at least EUR 100.- per day of stay; or\n  - at least EUR 50.- per day of stay if holding a confirmed\n  invitation or a tourist voucher.\nWarning:\n- Visitors not holding return/onward tickets could be refused\n  entry (SEE NOTE 43780).\n    NOTE 43780: Not applicable to nationals of United Kingdom","vaccination":"Vaccinations not required.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"HRV","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}