{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid for a minimum of 6 months from the arrival date. \nPassport Exemptions:\n- Holders of machine-readable emergency or temporary\n  passports. \nAdmission and Transit Restrictions:\n- Admission refused to visitors who have transited Guinea,\n  Liberia  and Sierra Leone. \n\nVisa required, except for A max. stay of 3 months for\nnationals of Solomon Isl.. \nVisa Issuance:\n- E-visas can be applied for at http://www.ecitizen.go.ke .\n  Effective from 1 September 2015, the visa on arrival\n  facility will be fully replaced by e-visas. \nMinors:\n- Unaccompanied minors must hold their own travel documents.\n- If minor is travelling on a passport of a parent\n  \nAdditional Information:\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay (at least USD 500.-) and documents for\n  their next destination. \nWarning:\n- Visitors holding damaged passports and/or passport replacing\n  documents will be refused entry. \n- Visitors not holding return/onward tickets could be refused\n  entry","vaccination":"Passengers arriving within 6 days after leaving or transiting\ncountries with risk of yellow fever transmission For details, click here\nand not holding a yellow fever vaccination certificate are\nsubject to quarantine for 6 days. \n\nExempt from Yellow Fever vaccination:\n- Children under 1 year of age.\n- Passengers transiting countries with risk of yellow fever\n  transmission provided not leaving the transit areas.\nRecommended:\n- Vaccination against Yellow Fever for all passengers over 9\n  months of age visiting any area outside the main cities in\n  Kenya.\n- Malaria prophylaxis: malaria risk, mainly due to P.\n  falciparum, exists throughout the year in the whole country.\n  There is normally little risk in the city of Nairobi and in\n  the highlands (above 2500m.) of Central, Rift Valley,\n  Eastern, Nyanza and Western Provinces. Recommended\n  prevention: C. ","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"KEN","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}