{"longInfo":"Passport required.\n- Passports and/or passport replacing documents must be valid\n  on arrival.\n\nVisa required, except for Former nationals of Sao Tome and\nPrincipe, born in Sao Tome and Principe.\nVisa required, except for Spouses and descendants of a former\nnational of Sao Tome and Principe, who is born in Sao Tome and\nPrincipe, if traveling with the former national.\nVisa Issuance:\n- E-Visas can be applied for, prior to departure, at\n  http://www.smf.st/virtualvisa/. Printed Visa authorization\n  must be presented at the time of travel. \nAdditional Information:\n- Visitors are required to hold documents for their next\n  destination. \nWarning:\n- Nationals of Russian Fed. who have visited Guinea, Liberia,\n  Nigeria or Sierra Leone within the last 30 days will be\n  refused entry","vaccination":"Vaccination against yellow fever required if arriving within 6\ndays after leaving or transiting countries with risk of yellow\nfever transmission For details, click here.\n\nExempt from Yellow Fever vaccination:\n- Children under 1 year of age.\n- Passengers transiting countries with risk of yellow fever\n  transmission within 12 hours if not leaving the transit\n  areas. \nRecommended:\n- Malaria prophylaxis: malaria risk, mainly due to P.\n  falciparum, exists throughout the year in the whole country.\n  Recommended prevention: C.","Type":"NotRequired","Schengen":"Unknown","USA":"Unknown","target":"STP","shortInfo":"Нужно подать заявку на сайте миграционной службы этого государства. Потребуется заполнить анкету, прикрепив к ней скан паспорта и скан подтверждения брони отеля (либо, в случае транзита, билетов в третью страну) в формате PDF. Рассмотрение визового запроса занимает 7 дней. После принятия положительного решения заявителю на адрес электронной почты придет подтверждение с индивидуальным номером визы и штрихкодом. Документ нужно распечатать и предъявить при посадке в самолет, а затем — при прохождении границы. На контрольно-пропускном пункте потребуется оплатить визовый сбор в размере около $50.","alias":{"general":"green","schengen":"red","usa":"red"}}