{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid for a minimum of 1 month beyond the period of intended\n  stay. \n\nVisa Issuance:\nVisa required, except for Nationals of Samoa traveling as\ntourist can obtain a visa on arrival for a max. stay of 1\nmonth at Beirut (BEY), if holding a telephone number and\naddress in Lebanon . Free of charge. Extension of stay\npossible for additional 2 months.\n- Holders of a pre-arranged approval issued to businessmen,\n  bankers, directors and investors by the Lebanese Immigration\n  Directorate can obtain a visa on arrival at Beirut (BEY),\n  for a max. stay of 6 months.\n- Tourist groups (minimum of 8 people) can obtain a visa on\n  arrival at Beirut (BEY), for a max. stay of 6 months,\n  provided sponsored by a registered tour operator in Lebanon.\n  \n- Holders of a written notification issued by the Lebanese\n  Immigration Directorate confirming that a visa is available,\n  can obtain a visa on arrival at Beirut (BEY).\n- Maids of those accredited to Lebanon can also obtain a visa\n  on arrival.\nMinors:\n- Minors under 18 years of age can enter with passports valid\n  for the period of intended stay, when accompanied by a\n  parent.\n- Children under 15 years of age, \n- Children under 15 years of age, \nAdditional Information:\n- Females, having previously undertaken employment as artists\n  or masseuses in Lebanon \nWarning:\n- Holders of passports containing any Israeli visa or stamp\n  will be refused entry.\n- Maids must ensure that their passport includes a departure\n  stamp issued by the country they departed from","vaccination":"Vaccination against yellow fever required if arriving within 6\ndays after leaving or transiting countries with risk of yellow\nfever transmission For details, click here or Cape Verde. \n\nExempt from Yellow Fever vaccination:\n- Children under 9 months of age. \n- Passengers transiting countries with risk of yellow fever\n  transmission provided not leaving the transit areas.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"LBN","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}