{"longInfo":"Passport required.\n- Passports and/or passport replacing documents must be valid\n  for at least 6 months beyond the period of intended stay.\n\nVisa required, except for A max. stay of 3 months:\n - for nationals of Argentina; \nVisa required, except for Holders of documents that prove\nplace of birth to be in Guyana (e.g. passport or Birth\nCertificate).\nVisa Issuance:\n- Holders of confirmation, issued by the Ministry of Home\n  Affairs, of a pre-arranged business, employment or student\n  visa can obtain their visa on arrival. Fee: USD 140.-.\nMinors:\n- Visa not required for foreign minors (up to/incl. 17 years\n  of age) born to nationals of Guyana,\n  \nAdditional Information:\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents required for their next\n  destination. (SEE NOTE 44676)  \n    NOTE 44676: Not applicable to CARICOM employees, guests\n   and their families.\nWarning:\n- Visitors not holding return/onward ticket could be refused\n  entry. (SEE NOTE 44676)  \n    NOTE 44676: Not applicable to CARICOM employees, guests\n   and their families","vaccination":"Vaccination against yellow fever required if arriving within 6\ndays after leaving or transiting countries with risk of yellow\nfever transmission For details, click here (not required if arriving\nfrom Argentina, Paraguay, Suriname or Trinidad and Tobago).\n\nExempt from Yellow Fever vaccination:\n- Children under 1 year of age.\n- Passengers transiting countries with risk of yellow fever\n  transmission provided not leaving the transit area.\nWarning:\n- Passengers not holding a yellow fever certificate, if\n  required, will not be allowed to disembark. \nRecommended:\n- Vaccination against yellow fever for all passengers.\n  Malaria prophylaxis: malaria risk (P. vivax and P.\n  falciparum) is high throughout the year in all parts of the\n  interior. Sporadic cases of malaria have been reported from\n  the densely populated coastal belt. Recommended prevention\n  in risk areas: C. ","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"GUY","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}