{"longInfo":"Passport required.\n- Passports and other documents accepted for entry issued to\n  nationals of Reunion must be valid on arrival. \nPassport Exemptions:\n- Holders of emergency or temporary passports. \n\nVisa required, except for A max. stay of 90 days:\nMinors:\n- Passport not required for minors under 18 years of age,\n  provided:  \n- WARNING! In accordance with European Union (EU) Legislation,\n  all minors who are nationals of Reunion will be expected to\n  hold their own passport or National ID Card (where\n  applicable) when departing from Bulgaria, Croatia, Cyprus,\n  Romania or a Schengen Member State . \n- Up to and incl. 17 years of age \nAdditional Information:\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents required for their next\n  destination.\nWarning:\n- Visitors must hold return/onward tickets .\n - Exempt are holders of foreign passports stating Costa Rica\n   as place of birth.\n - Exempt are holders of a  resolution of approval  issued to\n   those who have been granted residence in Costa Rica but\n   have not received their Residence Permit \"Cedula de\n   Residencia\"","vaccination":"Vaccination against Yellow Fever required if arriving within 6\ndays after leaving or transiting Angola, Benin, Bolivia,\nBrazil, Burkina Faso, Cameroon, Colombia, Congo (Dem. Rep.),\nEcuador, French Guiana, Gabon, Gambia, Ghana, Guinea, Liberia,\nNigeria, Peru, Sierra Leone, Sudan or Venezuela.\nThe certificate of yellow fever vaccination is valid for life.\n\nExempt from Yellow Fever vaccination:\n- Children under 9 months of age and adults above 60 years of\n  age. \n- Passengers transiting countries with risk of yellow fever\n  transmission if not leaving the transit areas.\n- Expectant mothers (or when in the breast feeding period) and\n  those holding a proof of medical contraindication.\nRecommended:\n- Malaria prophylaxis. malaria risk mainly due to P. vivax.\n  Negligible or no risk of malaria transmission exists, except\n  for very low risk in the canton of Matina, Limon Province.\n  Recommended prevention in risk areas: A. ","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"CRI","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}