{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid on arrival.\nAdmission and Transit Restrictions:\n- Nationals of Pakistan are only allowed to enter or transit\n  through India if arriving at Chennai (MAA), Delhi (DEL) or\n  Mumbai (BOM). \n\nVisa required.\n\nAdditional Information:\n- Indian law does not permit dual nationality for nationals of\n  India.  \n- Indian visa stickers have no seal/signature from the issuing\n  authority. (SEE NOTE 57490)\n    NOTE 57490: Not applicable to PIO card holders. \n- Nationals of Pakistan holding multiple entry Tourist Visas\n  (type T), with a validity ranging from above 3 months and up\n  to 10 years, are required to have at least 60 days between\n  visits. (SEE NOTE 54918)\n    NOTE 54918: Those wishing to re-enter before the 60 days\n   have expired must contact an Indian mission abroad to\n   obtain permission.  \n- Visa extensions possible, except for \"T\" (tourist) visas and\n  Transit visas, by applying at the Ministry of Foreign\n  Affairs. (SEE NOTE 57490)\n    NOTE 57490: Not applicable to PIO card holders. \n- Valid visas in expired passports are still acceptable,\n  provided accompanied by a valid passport of the same\n  nationality of the expired passport.\n- Holders of visas that specifically state the city/airport of\n  entry must enter India at the specified city/airport. (SEE\n  NOTE 57490) \n    NOTE 57490: Not applicable to PIO card holders. \n- Nationals of Pakistan, belonging to a Tourist Group\n   (SEE NOTE 57490)\n    NOTE 57490: Not applicable to PIO card holders. \n- Restricted/Protected Area Permits: A permit is required for\n  foreigners wishing to visit the following:\n  \nWarning:\n- Passengers who have visited Guinea, Liberia, Mali or Sierra\n  Leone within the last 30 days must enter India at Bangalore\n  (BLR), Chennai (MAA) ,Cochin (COK), Delhi (DEL), Hyderabad\n  (HYD), Kolkata (CCU) or Mumbai (BOM) and are subject to\n  screening and medical checks upon arrival. \n- Holders of normal passports issued by Pakistan must hold 2\n  copies of their visa application form (issued by an Indian\n  embassy/high commission). \n- Visitors holding tourist or business visas must hold\n  return/onward tickets. (SEE NOTE 57490) (SEE NOTE 57548) \n    NOTE 57490: Not applicable to PIO card holders. \n    NOTE 57548: Not applicable to holders of multiple entry\n   visa, issued for validity period of at least 1 year.  Not\n   applicable to holders of any other type of visa. E.g.\n   Conference Visa, Journalist visa, Medical Visa,\n   Missionaries Visa, Research Visa","vaccination":"Passengers arriving within 6 days after leaving or transiting\ncountries with risk of yellow fever transmission For details, click here\nand not holding a yellow fever vaccination certificate are\nsubject to quarantine for 6 days. Quarantine facilities are\nonly available at Delhi (DEL), Chennai (MAA) and Mumbai (BOM).\nAt other airports passengers will be deported.\n\nExempt from Yellow Fever vaccination:\n- Children under 6 months of age. \n- Passengers transiting countries with risk of yellow fever\n  transmission provided not leaving the transit areas.\nRecommended:\n- Malaria prophylaxis: malaria risk (P. vivax and P.\n  falciparum) exists in the whole country below 2000m. There\n  is no transmission in parts of the states of Himachal\n  Pradesh, Jammu and Kashmir and Sikkim. Recommended\n  prevention in risk areas: C. \n- Passengers arriving from Afghanistan, Ethiopia, Kenya,\n  Somalia, Syria, Nigeria or Pakistan are recommended to hold\n  an International Certificate of Vaccination proving the\n  passenger was vaccinated against polio preferably 4 weeks\n  and not more than one year before travel. Those not holding\n  Certificate of Vaccination will receive a dose of oral polio\n  vaccine (OPV) on arrival.","Type":"Required","Schengen":"Unknown","USA":"Unknown","target":"IND","shortInfo":null,"alias":{"general":"red","schengen":"red","usa":"red"}}