{"longInfo":"Passport required.\n- Passports and/or passport replacing documents must be valid\n  for at least 3 months beyond the period of intended stay. \nPassport Exemptions:\n- Holders of emergency or temporary passports.\n\nVisa required, except for A max. stay of 90 days for holders\nof a double or multiple entry  C  visa issued by a Schengen\nMember State  valid for the period of intended\nstay. \nVisa required, except for A max. stay of 90 days for holders\nof a double or multiple entry short stay visa issued by\nBulgaria, Croatia or Romania valid for the period of intended\nstay. \n- Information on Schengen visas \nMinors:\n-  Passport required unless \n- A visa issued to the parent is also valid for the minor\n  provided minor's name is also mentioned in the visa.\nAdditional Information:\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents for their next destination . \n- Nationals of Ukraine traveling from Ukraine may be issued\n  with an approved \"Pro-visa\" on a separate piece of paper. \n- Valid visas in full, invalidated or expired travel documents\n  are accepted if accompanied by a new travel document. \n- The max. stay is granted within 180 days.\nWarning:\n- Passports and passport replacing documents issued more than\n  10 years prior to date of travel are not accepted.\n- These entry regulations apply only to the part of Cyprus\n  controlled by the government of Cyprus (i.e. they are not\n  applicable at Ercan (ECN) and at Gercitkale (GEC)).\n - For entry regulations applicable at Ercan (ECN), see:\n   http://mfa.gov.ct.tr/consular-info/visa-regulations/ \n- Visitors not holding return/onward ticket could be refused\n  entry ","vaccination":"Vaccinations not required.","Type":"OnArrival","Schengen":"Allow","USA":"Unknown","target":"CYP","shortInfo":"Гражданам Украины для въезда в Республику Кипр необходимо оформить Pro-visa.<br /><br />Pro-visa дает право только однократного въезда в течение 90 дней, по про-визе в каждом полугодии турист может находиться на Кипре не более 3 месяцев.<br />Если туристы планируют круизы или поездки в другие страны в одном туре, необходимо ставить многократную визу в паспорт.<br />Про-виза оформляется в виде электронного файла, выдаваемого консульством Кипра, который необходимо распечатать из своей заявки и иметь при себе во время регистрации на рейс и при посадке в самолет, в противном случае туристы не будут допущены на борт.<br /><br />Важно:<ul><li>Вылет по про-визе возможен только для граждан Украины с вылетом из Украины, и только прямыми рейсами!</li><li>Запрещено посещение Кипра туристам у которых в паспорте стоит штамп о посещении «Турецкой Республики Северный Кипр»!</li></ul>","alias":{"general":"yellow","schengen":"green","usa":"red"}}