{"longInfo":"Passport required.  \n- Passports and other documents accepted for entry must be\n  valid for the period of intended stay.\n\nVisa required, except for Nationals of Ukraine traveling as\ntourists.\nVisa required, except for Nationals of Ukraine traveling as\ntourists: \n - for holders of normal passports; \nMinors:\n- Passengers under 18 years of age leaving the Dominican\n  Rep., \nAdditional Information:\n- Visitors must hold documents required for their next\n  destination. \n- Nationals of Ukraine traveling as tourists, must buy a\n  Tourist Card on arrival. Fee: USD 10.- for 30 days.\n  Extensions possible for addition fees.\nWarning:\n- Nationals of Ukraine who have visited Guinea, Liberia,\n  Nigeria, Senegal or Sierra Leone within the last 30 days\n  will be refused entry.\n- Visitors not holding return/onward tickets could be refused\n  entry.\n - Exempt are holders of foreign passports stating Dominican\n   Rep. as place of birth.\n\n\n\n Dominican Rep","vaccination":"Vaccinations not required.\n\nRecommended:\n- Malaria prophylaxis. malaria risk, exclusively due to P.\n  falciparum, exists throughout the year especially in rural\n  areas of the western provinces such as Dajabon, Elias Pina\n  and San Juan. Risk in other areas is low to negligible.\n  Recommended prevention in risk areas: B.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"DOM","shortInfo":"Для граждан Украины предварительного оформления визы не требуется. В пункте прибытия выдается туристическая карта на 30 или 60 дней: необходимо заплатить $10. От сбора освобождены транзитные пассажиры и дети до 2-х лет. Продление туристической карты возможно в местных органах полиции. За пребывание по непродленной карте при выезде платится штраф (62,4 песо - до 90 дней, 100 песо - на год).  Дети до 13 лет, путешествующие без родителей или в сопровождении одного из родителей или опекуна, должны иметь нотариально заверенное разрешение на поездку от другого родителя или опекуна. Если срок действия загранпаспорта меньше 3-х месяцев, туриста могут не пустить в страну.","alias":{"general":"yellow","schengen":"red","usa":"red"}}