{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid for a minimum of 6 months from the arrival date. \nPassport Exemptions:\n- Holders of emergency or temporary passports. \n\nVisa required, except for A max. stay of 30 days for:\n - holders of a multiple-entry business or tourist visa issued\n   by Canada, Iceland, Liechtenstein, Norway, Switzerland or a\n   EU Member State . The length of granted stay\n   will not exceed the validity of the visa; \n - holders of a multiple-entry business or tourist visa issued\n   by Japan, provided the visa has been used and is valid for\n   at least 6 months beyond the date of arrival. \n - holders of a multiple-entry ''B1'', ''B2'' or ''D'' visa,\n   issued by the USA provided valid for the period of intended\n   stay; \n - holders of a visa issued by the USA (except for ''B1'',\n   ''B2'', ''C1'' and ''D'' visas), provided valid for at\n   least 6 months from date of arrival;\nMinors:\n- Passport not required for minors under 18 years of age,\n  provided:  \n- Up to and incl. 17 years of age \nAdditional Information:\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents required for their next\n  destination.\n- Extension of stay possible for a total stay of 90 days.\n- Visas must be used within 60 days after date of issuance.\nWarning:\n- Visitors must hold return/onward tickets .\n - Exempt are holders of foreign passports stating Costa Rica\n   as place of birth.\n - Exempt are holders of a  resolution of approval  issued to\n   those who have been granted residence in Costa Rica but\n   have not received their Residence Permit \"Cedula de\n   Residencia\"","vaccination":"Vaccination against Yellow Fever required if arriving within 6\ndays after leaving or transiting Angola, Benin, Bolivia,\nBrazil, Burkina Faso, Cameroon, Colombia, Congo (Dem. Rep.),\nEcuador, French Guiana, Gabon, Gambia, Ghana, Guinea, Liberia,\nNigeria, Peru, Sierra Leone, Sudan or Venezuela.\nThe certificate of yellow fever vaccination is valid for life.\n\nExempt from Yellow Fever vaccination:\n- Children under 9 months of age and adults above 60 years of\n  age. \n- Passengers transiting countries with risk of yellow fever\n  transmission if not leaving the transit areas.\n- Expectant mothers (or when in the breast feeding period) and\n  those holding a proof of medical contraindication.\nRecommended:\n- Malaria prophylaxis. malaria risk mainly due to P. vivax.\n  Negligible or no risk of malaria transmission exists, except\n  for very low risk in the canton of Matina, Limon Province.\n  Recommended prevention in risk areas: A. ","Type":"Required","Schengen":"Allow","USA":"Allow","target":"CRI","shortInfo":"Необходимо заранее подавать заявление на визу, но держатели визы США, Канады или ЕС действительной ещё, как минимум, 3 месяца могут находиться в стране до 30 дней без визы. Готовится переход на электронные визы по образцу Мексики.","alias":{"general":"red","schengen":"green","usa":"green"}}