{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid on arrival.\n\nVisa required.\n\nVisa Issuance:\n- Holders of normal passports can obtain a prearranged visa on\n  arrival for a max. stay of 3 months at Beijing (PEK),\n  provided:    \n- Holders of normal passports can obtain a prearranged visa on\n  arrival for a max. stay of 1 month at Chengdu (CTU), Fuzhou\n  (FOC), Shanghai (Hongqiao (SHA) and Pudong (PVG)) or Xiamen\n  (XMN), provided:  \n    (SEE NOTE 53943)\n    NOTE 53943: A visa and invitation letter is not required\n   for a stay of max. 5 days when arriving at and departing\n   from Xiamen (XMN). Passengers must remain in Xiamen city\n   for the whole duration of stay.\n- Holders of normal passports can obtain a prearranged visa on\n  arrival at Chongqing (CKG), Guangzhou (CAN), Guilin (KWL),\n  Haikou (HAK), Kunming (KMG), Qingdao (TAO), Sanya (SYX),\n  Shenzhen (SZX), Weihai (WEH), Xi An (XIY) and Yantai (YNT),\n  provided:  \n   \n- A visa can be obtained on arrival at Hangzhou (HGH), for\n  tourist groups of travel agencies belonging to the Zhejiang\n  Province, for a max. stay of 1 month. Fee: CNY130.-. \nMinors:\n- Passport not required for children travelling with a parent\n  or guardian, provided \n- WARNING! In accordance with European Union (EU) Legislation,\n  all minors who are nationals of Lithuania will be expected\n  to hold their own passport or National ID Card (where\n  applicable) when departing from Bulgaria, Croatia, Cyprus,\n  Romania or a Schengen Member State . \n- An individual visa is not required for children travelling\n  on the passport of a parent or guardian, provided\n   \nAdditional Information:\n- Travel on a one-way ticket is accepted. However, visitors\n  are required to hold proof of sufficient funds to cover\n  their stay and documents required for their next\n  destination. \n- Valid visas or resident permits in expired passports are\n  accepted if holding valid passport of the same nationality.\n- When a visa is used, a round entry stamp is placed in the\n  passport  \n- Passengers traveling to Tibet must hold a special Tibet\n  Entry Permit. \n\n\n\n China (People's Rep","vaccination":"Passengers arriving within 6 days after leaving or transiting\ncountries with risk of yellow fever transmission For details, click here\nand not holding a yellow fever vaccination certificate are\nsubject to vaccination upon arrival. At the airport of Dalian\n(DLC) passenger will be kept in quarantine for 10 days or\ndeported.\n\nExempt from Yellow Fever vaccination:\n- Children under 9 months of age.\n- Passengers transiting countries with risk of yellow fever\n  transmission provided not leaving the transit areas.\nRecommended:\n- Malaria prophylaxis. Malaria risk, including P. falciparum,\n  exists in Yunnan and Hainan. P. falciparum resistance to\n  chloroquine and sulfadoxine-pyrimethamine reported. Limited\n  risk of P. vivax malaria exists in southern and some central\n  provinces. There is no malaria risk in the urban areas.\n  Recommended prevention in risk areas: B; in Hainan and\n  Yunnan: C. ","Type":"Required","Schengen":"Unknown","USA":"Unknown","target":"CHN","shortInfo":null,"alias":{"general":"red","schengen":"red","usa":"red"}}