{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid on arrival.\n\nVisa required, except for Nationals of Nepal. However, if\narriving from mainland China (People's Rep.) a visa is\nrequired (note: does not incl. Hong Kong (SAR China) or Macao\n(SAR China)). \nMinors:\n- Nationals of Nepal, traveling directly from Nepal, aged:\n  - up to/incl. 9 years of age, do not require any\n  documentation, if accompanied by parents/guardian; or\n  - 10 up to/incl. 18 years of age, can travel with a\n  certified identity document containing photo, issued by the\n  Principal or Head of an educational institution.\nAdditional Information:\n- Indian law does not permit dual nationality for nationals of\n  India.  \n- U visas are no longer issued to those who have been granted\n  Overseas Citizenship of India (OCI) status.\n  \n- Nationals of Nepal being of Pakistani origin holding\n  multiple entry Tourist Visas (type T), with a validity\n  ranging from above 3 months and up to 10 years, are required\n  to have at least 60 days between visits. (SEE NOTE 54918) \n    NOTE 54918: Those wishing to re-enter before the 60 days\n   have expired must contact an Indian mission abroad to\n   obtain permission.  \n- Visa extensions possible, except for \"T\" (tourist) visas and\n  Transit visas, by applying at the Ministry of Foreign\n  Affairs. (SEE NOTE 57490)\n    NOTE 57490: Not applicable to PIO card holders. \n- Valid visas in expired passports are still acceptable,\n  provided accompanied by a valid passport of the same\n  nationality of the expired passport.\n- Holders of visas that specifically state the city/airport of\n  entry must enter India at the specified city/airport. (SEE\n  NOTE 57490) \n    NOTE 57490: Not applicable to PIO card holders. \n- Restricted/Protected Area Permits: A permit is required for\n  foreigners (SEE NOTE 23756) wishing to visit the following:\n  \n    NOTE 23756: Not required for nationals of:\n   - Bhutan traveling by air to/from Bhutan via Bagdodra;\n   - Nepal travellng by air to/from Kathmandu.\n   If surface travel via restricted areas is involved,\n   passengers must hold a \"pass\" issued by the Foreigners\n   Regional Registration Office or the Superintendent of\n   police, or the diplomatic representation of India in Bhutan\n   or Nepal.\nWarning:\n- Passengers who have visited Guinea, Liberia, Mali or Sierra\n  Leone within the last 30 days must enter India at Bangalore\n  (BLR), Chennai (MAA) ,Cochin (COK), Delhi (DEL), Hyderabad\n  (HYD), Kolkata (CCU) or Mumbai (BOM) and are subject to\n  screening and medical checks upon arrival. \n- Visitors holding tourist or business visas must hold\n  return/onward tickets. (SEE NOTE 57490) (SEE NOTE 57548) \n    NOTE 57490: Not applicable to PIO card holders. \n    NOTE 57548: Not applicable to holders of multiple entry\n   visa, issued for validity period of at least 1 year.  Not\n   applicable to holders of any other type of visa. E.g.\n   Conference Visa, Journalist visa, Medical Visa,\n   Missionaries Visa, Research Visa","vaccination":"Passengers arriving within 6 days after leaving or transiting\ncountries with risk of yellow fever transmission For details, click here\nand not holding a yellow fever vaccination certificate are\nsubject to quarantine for 6 days. Quarantine facilities are\nonly available at Delhi (DEL), Chennai (MAA) and Mumbai (BOM).\nAt other airports passengers will be deported.\n\nExempt from Yellow Fever vaccination:\n- Children under 6 months of age. \n- Passengers transiting countries with risk of yellow fever\n  transmission provided not leaving the transit areas.\nRecommended:\n- Malaria prophylaxis: malaria risk (P. vivax and P.\n  falciparum) exists in the whole country below 2000m. There\n  is no transmission in parts of the states of Himachal\n  Pradesh, Jammu and Kashmir and Sikkim. Recommended\n  prevention in risk areas: C. ","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"IND","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}