{"longInfo":"Passport required. \n- Expired British passport (no time limit) endorsed  British\n  Citizen  is accepted. \n- Expired British passport (no time limit) endorsed  British\n  Subject  is accepted, provided stating  Citizen of the\n  United Kingdom and Colonies  and containing a Certificate of\n  Entitlement to the Right of Abode.\n- British passport endorsed  British National (Overseas) ,\n   British Overseas Citizen ,  British Overseas Territories\n  Citizen ,  British Subject  or  British Protected Person \n  must be valid on arrival. \n- National ID Cards issued by Gibraltar must be valid on\n  arrival. \nPassport Exemptions:\n- Holders of an ID Card issued by Gibraltar. \n- Holders of emergency or temporary passports.\n\nVisa required, except for Holders of British passports\nendorsed:  British Citizen ,  British National (Overseas) ,\n British Overseas Citizen ,  British Overseas Territories\nCitizen  or  British Protected Person .\nVisa required, except for Holders of British passports\nendorsed  British Subject  stating  Citizens of the United\nKingdom and Colonies\". \nVisa required, except for Holders of Identity Cards issued by\nthe Gibraltar Authorities.\nMinors:\n- When their names are registered in the passport of (one of)\n  their parents or guardians, \nAdditional Information:\n- Flights between the United Kingdom and the Channel Islands,\n  Ireland (Rep.) and Isle of Man are treated as domestic\n  flights, therefore are not subject to UK immigration\n  control. \n- Holders of British passports endorsed  British National\n  (Overseas) ,  British Subject ,  British Overseas Citizen ,\n   British Overseas Territories Citizen  or  British Protected\n  Person  will not have the automatic right of abode in the\n  United Kingdom and their passports will have one of the\n  following endorsements: either: \"Holder is subject to\n  control under the Immigration Act 1971 ; or:  Holder is\n  entitled to readmission to the United Kingdom  or  Holder\n  has the right of abode in the United Kingdom\" or \"In\n  accordance with the United Kingdom immigration rules the\n  holder of this passport does not require an entry\n  certificate or visa to visit the United Kingdom ","vaccination":"Vaccinations not required.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"GBR","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}