{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid for a minimum of 6 months beyond the period of\n  intended stay. \n - Passports and other documents accepted for entry must be\n   valid for a minimum of 3 months beyond the period of\n   intended stay when arriving at Basra (BSR). \n - Passports and other documents accepted for entry must be\n   valid on arrival when arriving at Erbil (EBL) or\n   Sulaymaniyah (ISU).  \nAdmission and Transit Restrictions:\n- Admission and transit is refused to nationals of Israel\n  arriving at Baghdad (BGW), Basra (BSR), Mosul (OSM) or Najaf\n  (NJF). \n\nVisa required, except for Holders of a signed and stamped\nletter issued by the Ministry of Interior of the Kurdistan\nRegional Government if arriving at Erbil (EBL) and\nSulaymaniyah (ISU). . \nVisa Issuance:\n- Holders of proof of being of Iraqi origin can obtain a visa\n  on arrival at Erbil (EBL) and Sulaymaniyah (ISU). Holding an\n  old Iraqi passport, residence card or identity card are\n  considered sufficient proof of Iraqi origin. Place of birth\n  in Iraq or having Iraqi parents does not prove being of\n  Iraqi origin.\nAdditional Information:\n- Group visas \nWarning:\n- Nationals of Israel who have visited Congo (Dem. Rep.),\n  Guinea, Liberia, Nigeria, Senegal and Sierra Leone within 3\n  months prior to arrival in Iraq are subject to screening and\n  health check. Exempt are holders of diplomatic passports","vaccination":"Vaccination against yellow fever required if arriving within 6\ndays after leaving or transiting countries with risk of yellow\nfever transmission For details, click here.\n\nExempt from Yellow Fever vaccination:\n- Children under 6 months of age.\n- Passengers transiting countries with risk of yellow fever\n  transmission provided not leaving the transit areas.\nRecommended:\n- Malaria prophylaxis: malaria risk, exclusively to P. vivax,\n  is limited and may exist from May to November inclusive in\n  areas in the north below 1500m (Duhok, Erbil and Sulaimaniya\n  provinces). Recommended prevention in risk areas: none. ","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"IRQ","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}