{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid for a minimum of 30 days beyond the period of intended\n  stay. \n- When holding a visa for entry into Viet Nam, passports must\n  be valid at least 1 month after the expiry date of the visa.\n  \nPassport Exemptions:\n- Holders of emergency passports issued to nationals of\n  Bulgaria. \n\nVisa required, except for A max. stay of 30 days for nationals\nof Bulgaria arriving at Phu Quoc (PQC).\nVisa required, except for A max. stay of 90 days for holders a\n Certificate of Visa Exemption  issued to former nationals of\nViet Nam residing abroad, or to nationals of Viet Nam not\nholding a Vietnamese passport but only holding a foreign\npermanent resident card. \nVisa required, except for Nationals of Bulgaria arriving at\nHanoi (HAN) or Ho Chi Minh City (SGN) and holding onward\ntickets for a connecting flight, on the same day, to Phu Quoc\n(PQC). Passengers are required to remain in the transit area\nof Hanoi (HAN) or Ho Chi Minh City (SGN) and clear immigration\nat Phu Quoc (PQC) where they will be granted a max. stay of 30\ndays.\nVisa Issuance:\n- Holders of a pre-approval letter issued only in Ha Noi, Viet\n  Nam by the Vietnamese Immigration (Ministry of Public\n  Security) or the Consular Department (Ministry of Foreign\n  Affairs), can obtain a visa on arrival for a max. stay of 1\n  or 3 months at Hanoi (HAN), Ho Chi Minh City (SGN) or Da\n  Nang (DAD). Fee: USD 45.- for a single-entry 1 or 3 months\n  visa; USD 65.- for a multiple-entry 1 month visa; or USD\n  95.- for a multiple-entry 3 months visa. \nMinors:\n- Minors arriving in or departing from Viet Nam who are 13\n  years old or younger must hold proof of being met by parent\n  or guardian at the airport of arrival.\n- WARNING! In accordance with European Union (EU) Legislation,\n  all minors who are nationals of Bulgaria will be expected to\n  hold their own passport or National ID Card (where\n  applicable) when departing from Bulgaria, Croatia, Cyprus,\n  Romania or a Schengen Member State . \nAdditional Information:\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents required for their next\n  destination.\n- Extension of stay possible for an additional 90 days, for\n  holders of a  Certificate of Visa Exemption . \nWarning:\n- Visa exempt visitors not holding return/onward tickets could\n  be refused entry","vaccination":"Vaccination against yellow fever required if arriving within 6\ndays after leaving or transiting countries with risk of yellow\nfever transmission For details, click here.\n\nExempt from Yellow Fever vaccination:\n- Children under 1 year of age.\n- Passengers transiting countries with risk of yellow fever\n  transmission provided not leaving the transit areas.\nRecommended:\n- Malaria prophylaxis: malaria risk, mainly due to P.\n  falciparum, exists in the whole country, excluding urban\n  centres, the Red River Delta, the Mekong Delta and the\n  coastal plain areas of central Viet Nam. High risk areas are\n  the highland areas below 1500 m. south of 18N, notably the\n  four central highlands provinces of Dak Lak, Dak Nong, Gia\n  Lai and Kon Tum, Binh Phuoc province and the western parts\n  of the coastal provinces Khanh Hoa, Ninh Thuan , Quang Nam\n  and Quang Tri. Recommended prevention in risk areas: C. ","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"VNM","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}