{"longInfo":"Passport required.\n- Passports issued to nationals of Slovakia must be valid for\n  the period of intended stay. \nPassport Exemptions:\n- Holders of a Form I-512 ( Authorization for Parole of an\n  Alien into the United States\"). \n- Holders of temporary or emergency passports. \n\nVisa required, except for A max. stay of 90 days for nationals\nof Slovakia traveling as a tourist, on business or in transit\n(SEE NOTE 42904) (SEE NOTE 60190). \n    NOTE 42904: Passengers must obtain an ESTA authorization\n   (via https://esta.cbp.dhs.gov/) prior to boarding. \n - for holders of biometric passports.\n    NOTE 60190: Passengers must hold a return/onward ticket.\nVisa required, except for Holders of a Form I-512\n( Authorization for Parole of an Alien into the United\nStates\").\nMinors:\n- Children, up to/incl. 15 years of age, being nationals of\n  Slovakia, are not allowed to enter the USA on their parents\n  passports. \n- Minors traveling unaccompanied, or accompanied by one parent\n  or a person other than parent/legal guardian,\n  . \n- WARNING! In accordance with European Union (EU) Legislation,\n  all minors who are nationals of Slovakia will be expected to\n  hold their own passport or National ID Card (where\n  applicable) when departing from Bulgaria, Croatia, Cyprus,\n  Romania or a Schengen Member State . \nAdditional Information:\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents required for their next\n  destination. \n- The following applies to those traveling under the US Visa\n  Waiver Program:\n - Each passenger must hold own passport (incl. biometric\n   Emergency/Temporary passport) and be traveling as a\n   tourist, on business or in transit. \n - A return/onward ticket (or electronic ticket record) must\n   be to a final destination country other than Canada, Mexico\n   or contiguous (adjacent) countries or territories situated\n   in or bordering the Caribbean Sea  . If\n   passenger holds proof of residence in, or is transiting the\n   USA to such a country or territory, an onward/return ticket\n   to that country or territory is accepted. \n - Passenger can make side trips to Canada, Mexico or\n   Caribbean countries/islands, provided first entering the\n   USA on a carrier participating in the VWP. No additional\n   time is given (extension) based on the departure to\n   contiguous (adjacent) territory  .  \n- A passenger may enter the USA with a valid visa in an\n  expired passport, provided \n- Beginning students holding \"F\", \"J\" or \"M\" student/exchange\n  visitor visas \nWarning:\n- Passengers who have visited Guinea, Liberia or Sierra Leone\n  within the last 21 days must enter the US at Atlanta (ATL),\n  Chicago (ORD), Newark (EWR), New York (JFK) or Washington\n  (IAD)  and are subject to screening and medical checks upon\n  arrival. \n\n\n\n Virgin Isl","vaccination":"Vaccinations not required.\n\nWarning:\n- Those entering on a K-1 or K-2 visa must hold a medical form\n  FS398 and X-ray plates of chest (full size not necessary).","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"VIR","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}