{"longInfo":"Passport required.\n- Passports and/or passport replacing documents must be valid\n  for the period of intended stay. \nPassport Exemptions:\n- Holders of a driver's licence, Voter's Registration Card,\n  Social Security Card or National ID Card issued to the\n  nationals listed below. ID Cards must have a photo and state\n  nationality. If nationality is not indicated, the ID card\n  must be accompanied by a Birth Certificate and the\n  information must be consistent with that of the ID card: \n - residents of Anguilla, Montserrat and the Virgin Isl.\n   (British). \n\nVisa required, except for A max. stay of 6 months:\n - for holders of British passports endorsed  British Overseas\n   Territories Citizen  or  British Overseas Citizen .\nVisa required, except for A max. stay of 1 month for nationals\nof Turks and Caicos Isl.;\nAdditional Information:\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents required for their next\n  destination. \n- Extension of stay possible for Turks and Caicos Isl..\n- Extension of stay possible for visitors eligible for the 1\n  month visa exemption. \n- Those of Vincentian parentage  \nWarning:\n- Nationals of Turks and Caicos Isl. who have visited Guinea,\n  Liberia, Nigeria or Sierra Leone within the last 28 days\n  will be refused entry. \n- Visitors not holding return/onward ticket could be refused\n  entry. \n\n\n\n St","vaccination":"Vaccination against yellow fever required if arriving within 6\ndays after leaving or transiting countries with risk of yellow\nfever transmission For details, click here except if arriving from\nArgentina. \n\nExempt from Yellow Fever vaccination:\n- Children under 1 year of age.\n- Passengers transiting countries with risk of yellow fever\n  transmission provided not leaving the transit areas.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"VCT","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}