{"longInfo":"Passport required.\n- Passports issued to nationals of Turks and Caicos Isl. must\n  be valid for a minimum of 1 month beyond the period of\n  intended stay. \n\nVisa required, except for Holders of British passports\nholding: \n - passport endorsed  British Citizen  (max. permitted stay 6\n   months); \n - passport which contains a Certificate of Entitlement to the\n   Right of Abode issued by the United Kingdom (max. permitted\n   stay 6 months); \n - in addition to their passport, alternative documentary\n   evidence to establish right of abode in the United\n   Kingdom,\n - passport endorsed  British National (Overseas)  for a max.\n   stay of 3 months.  \nMinors:\n- Minors entering New Zealand \nAdditional Information:\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay.  \n- Visitors are required to hold documents for their next\n  destination. \nWarning:\n- Holders of passports issued by Turks and Caicos Isl.\n  traveling under the New Zealand visa-waiver, must hold\n  return/onward tickets. (SEE NOTE 53749) \n    NOTE 53749: Exempt are holders of authorization issued by\n   New Zealand's immigration authorities waiving the return\n   ticket requirement. \n- Holders of British passports endorsed British Citizen or\n  British National (Overseas) or containing a Certificate of\n  Entitlement to the Right of Abode issued by the United\n  Kingdom; must hold return/onward tickets. (SEE NOTE 53749)\n    NOTE 53749: Exempt are holders of authorization issued by\n   New Zealand's immigration authorities waiving the return\n   ticket requirement. \n- Visitors holding a visa that specifies the requirement to\n  hold an outward ticket must hold return/onward tickets. (SEE\n  NOTE 53749)\n    NOTE 53749: Exempt are holders of authorization issued by\n   New Zealand's immigration authorities waiving the return\n   ticket requirement","vaccination":"Vaccinations not required.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"NZL","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}