{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid for a minimum of 6 months from the arrival date. \nPassport Exemptions:\n- Holders of emergency or temporary passports. \n\nVisa required, except for A max. stay of 30 days for nationals\nof Czech Rep. traveling as tourists. (SEE NOTE 46597) (SEE\nNOTE 59872) \n    NOTE 46597: Not applicable to holders of Emergency or\n   Temporary passports.\n    NOTE 59872: Applicable at Batam (BTH), Denpasar-Bali\n   (DPS), Jakarta Soekarno-Hatta (CGK), Medan Kuala Namu (KNO)\n   and Surabaya (SUB).\nVisa Issuance:\nVisa required, except for Nationals of Czech Rep. can obtain a\nvisa on arrival for a max. stay of 30 days,(SEE NOTE 43284)\n(SEE NOTE 46597) if: \n    NOTE 43284: Applicable at Balikpapan (BPN), Banda Aceh\n   (BTJ), Bandung (BDO), Batam (BTH), Denpasar-Bali (DPS),\n   Jakarta (Halim Perdana Kusuma (HLP) and Soekarno-Hatta\n   (CGK), Kupang (KOE), Lombok (LOP), Medan Kuala Namu (KNO),\n   Makassar (UPG), Manado (MDC), Padang (PDG), Palembang\n   (PLM), Pekan Baru (PKU), Pontianak (PNK), Semarang (SRG),\n   Surabaya (SUB), Surakarta (Solo) (SOC) and Yogyakarta\n   (JOG). \n    NOTE 46597: Not applicable to holders of Emergency or\n   Temporary passports.\nMinors:\n- Minors traveling together with nationals of Indonesia\n  working overseas must \n- WARNING! In accordance with European Union (EU) Legislation,\n  all minors who are nationals of Czech Rep. will be expected\n  to hold their own passport or National ID Card (where\n  applicable) when departing from Bulgaria, Croatia, Cyprus,\n  Romania or a Schengen Member State . \n- All children, even when included in their parent's\n  passports,  \nAdditional Information:\n- Passengers exceeding their permitted stay will be fined\n  (Note: The day of arrival in Indonesia is counted as the\n  first day of stay). \n- Visitors intending to travel to the Indonesian province of\n  Irian Jaya must obtain a permit (\"Surat Jalan\") from the\n  \"Dinas Intel Pam Pol MABAK\" in Jakarta or other regional\n  police headquarters.\n- Extensions of stay are possible depending on the type of\n  visa.\n- Nationals of Czech Rep. entering without a visa must depart\n  from Indonesia via the airports of Batam (BTH),\n  Denpasar-Bali (DPS), Jakarta Soekarno-Hatta (CGK), Medan\n  Kuala Namu (KNO) or Surabaya (SUB) or the seaports of Sri\n  Bintan, Sekupang, Batam Center or Tanjung Uban (Riau). \nWarning:\n- Visas must be used within 90 days after date of issuance.\n- Visitors must hold return/onward tickets ","vaccination":"Vaccination against yellow fever required if arriving within 6\ndays after leaving or transiting countries with risk of yellow\nfever transmission For details, click here.\n\nExempt from Yellow Fever vaccination:\n- Children under 9 months of age. \n- Passengers transiting countries with risk of yellow fever\n  transmission provided not leaving the transit areas.\nRecommended:\n- Malaria prophylaxis: malaria risk exists throughout the year\n  in most areas of the five eastern provinces of East Nusa\n  Tenggara, Maluku, North Maluku, Papua and West Papua. In\n  other parts of the country, there is malaria risk in some\n  districts, except in Jakarta Municipality, in cities and\n  urban areas as well as within the areas of the main tourist\n  resorts. Human P. knowlesi reported in the province of\n  Kalimantan. Recommended prevention in risk areas: C. ","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"IDN","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}