{"longInfo":"Passport required.\n- Passports and/or passport replacing documents must be valid\n  for at least 6 months from date of arrival. \nPassport Exemptions:\n- Holders of emergency or temporary passports.\n\nVisa required, except for Holders of a Persons of Surinamese\nOrigin (PSA) document.\nVisa Issuance:\nVisa required, except for Holders of normal, emergency or\ntemporary passports issued to nationals of French West Indies\ntraveling as a tourist can obtain a single entry Tourist Card\non arrival at Paramaribo International Airport (PBM), for a\nmax. stay of 90 days. Fee: between USD 20.- and USD 25.-. \nMinors:\n- WARNING! In accordance with European Union (EU) Legislation,\n  all minors who are nationals of French West Indies will be\n  expected to hold their own passport or National ID Card\n  (where applicable) when departing from Bulgaria, Croatia,\n  Cyprus, Romania or a Schengen Member State . \nAdditional Information:\n- Extension of stay available for a max. stay of 6 months for\n  visitors of Suriname origin. \nWarning:\n- Nationals of French West Indies who have visited Guinea,\n  Liberia or Sierra Leone within the last 21 days will be\n  refused entry. Exempt are holders of PCR (Polymerase Chain\n  Reaction) test certificate, proving they are Ebola virus\n  free.\n- All visitors are subject to screening and medical checks.\n  Passengers may be quarantined for further assessment. Exempt\n  are holders of PCR (Polymerase Chain Reaction) test\n  certificate, proving they are Ebola virus free. \n- Visitors not holding return/onward ticket could be refused\n  entry.\n - Exempt are: ","vaccination":"Vaccination against yellow fever required if arriving within 6\ndays after leaving or transiting countries with risk of yellow\nfever transmission For details, click here.\n\nExempt from Yellow Fever vaccination:\n- Children under 1 year of age.\n- Passengers transiting countries with risk of yellow fever\n  transmission provided not leaving the transit areas.\nRecommended:\n- Vaccination against yellow fever for all passengers visiting\n  any area outside the main cities in Suriname.\n  Malaria prophylaxis: malaria risk (P. vivax and P.\n  falciparum) exists throughout the year in the interior of\n  the country beyond the coastal savannah area, with highest\n  risk mainly along the eastern border and in goldmining\n  areas. In Paramaribo City and the other seven coastal\n  districts, transmission risk is low or negligible.\n  Recommended prevention in risk areas: C. ","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"SUR","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}