{"longInfo":"Passport required. \n- Passports and other documents accepted for entry must be\n  valid for a minimum of 30 days beyond the period of intended\n  stay. \nPassport Exemptions:\n- Holders of temporary or emergency passports. \nAdmission and Transit Restrictions:\n- Admission refused to holders of non-machine readable\n  passports (including emergency and temporary passports),\n  issued before 25 November 2005 or expiring after 24 November\n  2015.\n\nVisa required. \n\nMinors:\n- Aged up to/incl. 15 years of age \n- WARNING! In accordance with European Union (EU) Legislation,\n  all minors who are nationals of Slovenia will be expected to\n  hold their own passport or National ID Card (where\n  applicable) when departing from Bulgaria, Croatia, Cyprus,\n  Romania or a Schengen Member State . \n- Minors under 18 years of age, traveling to/from South\n  Africa, must hold: \n - Exempt are holders of a valid visa.\nAdditional Information:\n- South Africa does not accept loose leaf Temporary Travel\n  Documents.  \n- Extension of stay for additional 90 days is possible, if\n  \n  \n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents for their next destination. \nWarning:\n- Passports and passport replacing documents of all non-South\n  African nationals must contain at least 1 unused visa page\n   \n- Visitors must hold return/onward tickets ","vaccination":"Vaccination against yellow fever required if arriving within\n10 days from countries with risk of yellow fever transmission\nFor details, click here. \n\nExempt from Yellow Fever vaccination:\n- Passengers transiting countries with risk of yellow fever\n  transmission For details, click here for max. 12 hours and not leaving\n  the transit area. \n- Children under 1 year of age, provided holding a medical\n  certificate stating inoculation is undesirable.\n- Holders of a certificate of contraindication on medical\n  grounds, who will be placed under quarantine.\nRecommended:\n- Malaria prophylaxis: malaria risk, mainly due to P.\n  falciparum, exists throughout the year in the low altitude\n  areas of Limpopo Province, Mpumalanga Province (including\n  the Kruger National Park) and north-eastern Kwazulu Natal as\n  far south as the Tugela river. Risk is highest from October\n  to May. Recommended prevention in risk areas: C.","Type":"Required","Schengen":"Unknown","USA":"Unknown","target":"ZAF","shortInfo":null,"alias":{"general":"red","schengen":"red","usa":"red"}}