{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid for a minimum of 1 month beyond the period of intended\n  stay. \n - Passports and other documents accepted for entry issued by\n   Hong Kong (SAR China) must be valid on arrival. \n - \"Exit-entry Permit for Travelling to and from Hong Kong and\n   Macao\" (EEP); AND exit endorsement issued by Public\n   Security Bureau Office in Mainland China must be valid on\n   arrival. \nPassport Exemptions:\n- Holders of Hong Kong (SAR China) Permanent Identity Card. \n- Holders of \"Exit-entry Permit for Travelling to and from\n  Hong Kong and Macao\" (EEP).\n- Residents of Macao (SAR China) holding \"Macao Smart\n  Permanent Identity Card  (MSPIC) or  Macao (SAR China)\n  Travel Permit\".\n- Holders of \"Visit Permit for Residents of Macao (SAR China)\n  to Hong Kong (SAR China)\" (VPRM).\n- Holders of a PRC Travel Document (Lu Xing Zheng).\n- Holders of emergency or temporary passports.\n\nVisa required, except for Holders of Hong Kong (SAR China)\npassports. \nVisa required, except for Holders of \"Exit-entry Permit for\nTraveling to and from Hong Kong and Macao\" (EEP) containing\n(or accompanied by) an exit endorsement issued by Public\nSecurity Bureau Office in Mainland China stating purpose of\nentry. \nVisa required, except for Holders of a PRC Travel Document (Lu\nXing Zheng) containing an entry permit for Hong Kong (SAR\nChina) . \nVisa required, except for A max. stay of 180 days for holders\nof a  Macao Smart Permanent Identity Card  (MSPIC) ;\naccompanied by proof of Macao permanent residency. When not\nholding proof of permanent residency \n. \nVisa required, except for A max. stay of 180 days for\nresidents of Macao (SAR China) holding a \"Visit Permit for\nResidents of Macao (SAR China) to Hong Kong (SAR China)\" ;\naccompanied by proof of Macao permanent residency. When not\nholding proof of permanent residency \n. \nVisa required, except for A max. stay of 7 days for: \n - holders of passports issued by China (People's Rep.),\n   provided passenger is in transit (incl. overland) to/from a\n   third country.\n - holders of a Macao (SAR China) passport or a Macao (SAR\n   China) Travel Permit; \nVisa required, except for Holders of:\n- travel documents issued by the Hong Kong Immigration\nDepartment, endorsed with \"Holder's eligibility for Hong Kong\n(SAR China) Permanent Identity Card verified ; or\n- a Hong Kong (SAR China) Permanent Identity Card. \nVisa required, except for Holders of an APEC Business Travel\nCard (ABTC) provided endorsed  Valid for travel\nto HKG\":\n - traveling on business;\nAdditional Information:\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents required for their next\n  destination.\n- Female nationals of Mainland China (People's Rep.) in\n  advanced stages of pregnancy (28 weeks or more), suspected\n  to be entering Hong Kong to give birth, must hold a booking\n  confirmation certificate issued by a Hong Kong hospital,\n  proving arrangements for admission.\nWarning:\n- Passport number and nationality must match those stated on\n  the APEC Business Travel Card (ABTC).\n- Visitors not holding return/onward ticket could be refused\n  entry","vaccination":"Vaccinations not required.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"HKG","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}