{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid for a minimum of 30 days beyond the period of intended\n  stay. \nPassport Exemptions:\n- Holders of a Macao (SAR China) Identity Card.\n- Holders of a Visit Permit to Hong Kong (SAR China) for\n  residents of Macao (SAR China) issued by Macao (SAR China).\n- Holders of a PRC Travel Document (Lu Xing Zheng).  \n- Holders of a Hong Kong (SAR China) Permanent Identity Card. \n- Holders of an \"Entry and Exit Permit for Traveling to and\n  from Taiwan\" issued by China (People's Rep.), containing a\n  valid \"Exit endorsement to Taiwan\". \n- Holders of an \"Exit-entry Permit for Traveling to and from\n  Hong Kong and Macao\" (EEP) issued by China (People's Rep.),\n  containing a valid Exit endorsement to Macao (SAR China).\n- Holders of a Macao (SAR China) Travel Permit.\n- Holders of emergency or temporary passports.\n\nVisa required, except for Holders of a Macao (SAR China)\npassport.\nVisa required, except for Holders of a Macao (SAR China)\nIdentity Card.\nVisa required, except for Holders of a Visit Permit to Hong\nKong (SAR China) for residents of Macao (SAR China) issued by\nMacao (SAR China).\nVisa required, except for Holders of a Macao (SAR China)\nTravel Permit.\nVisa required, except for A max. stay of 1 year: \n - for holders of a Hong Kong Permanent Identity Card. \nVisa required, except for A max. stay of 7 days for passengers\nin transit to/from a third country, holding an onward ticket\nand all documents required for next destination: \n - for holders of passports issued by China (People's Rep.); \n - for holders of Hong Kong (SAR China) passports; \n - for holders of a PRC Travel Document (Lu Xing Zheng). \nVisa required, except for Holders of an \"Exit-entry Permit for\nTraveling to and from Hong Kong and Macao\" (EEP) issued by\nChina (People's Rep.), containing a valid Exit endorsement to\nMacao (SAR China). \nVisa required, except for A max. stay of 7 days for holders of\nan \"Entry and Exit Permit for Traveling to and from Taiwan\"\n(pink/purple booklet) issued by China (People's Rep.),\ncontaining a valid \"Exit endorsement to Taiwan\", in transit\nto/from Chinese Taipei. \nAdditional Information:\n- Visitors are required to hold proof of sufficient funds (at\n  least MOP 5000.-) to cover their stay and documents required\n  for their next destination. \n- Visitors can apply for a visa extension 5 days before the\n  expiry of their original visa. \nWarning:\n- Visitors not holding return/onward tickets could be refused\n  entry","vaccination":"Vaccinations not required.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"MAC","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}