{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid for a minimum of 6 months from the arrival date.\n - Former nationals of the Philippines, their immediate family\n   members and immediate family members of nationals of the\n   Philippines must hold passports valid on arrival.\n   \nPassport Exemptions:\n- Holders of emergency or temporary passports. \n\nVisa required, except for A max. stay of 30 days for holders\nof passports issued to nationals of France. \nVisa required, except for A max. stay of one year for former\nnationals of the Philippines (Balikbayans) holding proof of\nformer Filipino nationality. \nVisa required, except for A max. stay of one year for\naccompanying spouses and children of nationals of the\nPhilippines who have been outside the Philippines for more\nthan one year or former nationals of the Philippimes\n(Balikbayans) .  \nVisa Issuance:\nVisa required, except for Holders of passports issued by\nFrance can obtain a visa on arrival, for a max. stay of 59\ndays. Extension possible. Fee: USD 50.- (bank exchange slip is\nmandatory). Express fee: PHP 500.-.  \nMinors:\n- WARNING! In accordance with European Union (EU) Legislation,\n  all minors who are nationals of France will be expected to\n  hold their own passport or National ID Card (where\n  applicable) when departing from Bulgaria, Croatia, Cyprus,\n  Romania or a Schengen Member State . \n- Foreign minors, aged up to/incl. 14 years, not residing in\n  the Philippines and traveling without parents require a\n  Waiver of Exclusion Ground (WEG) \n- Foreign minors traveling accompanied by parents\n   \nAdditional Information:\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay and documents required for their next\n  destination.\n- Multiple extensions of 59 days, (with a maximum of 1 year),\n  available for those listed under visa exemptions.\n    \n- Length of stays are calculated by starting on the next day\n  after the day of arrival in the Philippines.\nWarning:\n- Visitors traveling for touristic or business purposes must\n  hold return/onward tickets:\n - exempt are former nationals of the Philippines\n   (Balikbayans) and accompanying spouses and children","vaccination":"Vaccination against yellow fever required if arriving within 6\ndays after leaving or transiting countries with risk of yellow\nfever transmission For details, click here.\n\nExempt from Yellow Fever vaccination:\n- Children under 1 year of age who are, however, subject to\n  isolation or surveillance when indicated.\n- Passengers transiting countries with risk of yellow fever\n  transmission provided not leaving the transit areas.\nRecommended:\n- Malaria prophylaxis: malaria risk exists throughout the year\n  in areas below 600m, except in the provinces of Aklan,\n  Albay, Benguet, Bilaran, Bohol, Camiguin, Capiz,\n  Catanduanes, Cavite, Cebu, Guimaras, Iloilo,\n  Northern/Southern Leyte, Marinduque, Masbate,\n  Eastern/Northern/Western Samar, Sequijor, Sorsogon, Surigao\n  Del Norte and metropolitan Manila. No risk considered to\n  exist in urban areas or in the plains. Human P. knowlesi\n  infection reported in the province of Palawan. Recommended\n  prevention in risk areas: C.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"PHL","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}