{"longInfo":"Passport required.\n- Passports and other documents accepted for entry must be\n  valid for the period of intended stay. \nPassport Exemptions:\n- Holders of emergency or temporary passports.\n\nVisa required, except for Holders of a valid \"C\" visa issued\nby the United Kingdom (SEE NOTE 44436) (SEE NOTE 56994) to\nnationals of Qatar, if they have first entered the United\nKingdom, for a max. stay of 90 days, or until the end of the\nperiod of stay granted in the United Kingdom, whichever is\nshorter. \n    NOTE 44436: For those arriving in the United Kingdom (UK),\n   including  \n    NOTE 56994: Not applicable to \"C\" visas issued for the\n   purpose of transit, marriage or to enter into a civil\n   partnership.\nVisa required, except for Nationals of Qatar if they have\nfirst entered the United Kingdom with a printed Electronic\nVisa Waiver (EVW) Document issued by the United Kingdom, for a\nmax. stay of 90 days, or until the end of the period of stay\ngranted in the United Kingdom, whichever is shorter. \nMinors:\n- Children up to/incl.16 years of age\n  \n- A separate visa is required for children up to/incl. 16\n  years of age if  \n- Visas issued to minors (persons under 18 years of age), with\n  a date of issue after 12 October 2014,\n   \nAdditional Information:\n- Visitors holding passports containing a British inadmissible\n  stamp could be refused entry.\n- Visitors are required to hold proof of sufficient funds to\n  cover their stay. \nWarning:\n- Entry stamps issued by the UK to nationals of Qatar having\n  entered the UK with an Electronic Visa Waiver (EVW) Document\n  are considered as sufficient for the purposes of entry into\n  Ireland (Rep.). However, it is recommended to also hold a\n  printed copy of the EVW at an Irish port of entry. \n- Visitors not holding return/onward tickets could be refused\n  entry. \n\n\n\n Ireland (Rep","vaccination":"Vaccinations not required.","Type":"OnArrival","Schengen":"Unknown","USA":"Unknown","target":"IRL","shortInfo":null,"alias":{"general":"yellow","schengen":"red","usa":"red"}}